app/views/comments/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<h3>Comments</h3>
<%= @post.comments.each do |comment| %>