app/controllers/posts_controller.rb

  def create

    @post = Post.new(post_params)

    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2018-04-21 20:03:45.126469"], ["updated_at", "2018-04-21 20:03:45.126469"]]